In [1]:
import sqlhelpers as sh

In [2]:
# %load Exercise Files\\Chapters\\sql-chap02.txt

# The Select Statement

In [3]:
q = "SELECT 'Hello, World';"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT 'Hello, World'; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
  'Hello, World'
0   Hello, World

In [4]:
q = 'SELECT * FROM Country;'
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT * FROM Country; |||

There are 239 rows in the query results table
There are 15 columns in the query results table

First 5 rows of the query results:
  Code                  Name      Continent                     Region  \
0  AFG           Afghanistan           Asia  Southern and Central Asia
1  NLD           Netherlands         Europe             Western Europe
2  ANT  Netherlands Antilles  North America                  Caribbean
3  ALB               Albania         Europe            Southern Europe
4  DZA               Algeria         Africa            Northern Africa

   SurfaceArea  IndepYear  Population  LifeExpectancy       GNP    GNPOld  \
0     652090.0     1919.0  22720000.0            45.9    5976.0       NaN
1      41526.0     1581.0  15864000.0            78.3  371362.0  360478.0
2        800.0        NaN    217000.0            74.7    1941.0       NaN
3      28748.0     1912.0   3401200.0            71.6    3205.0    2500.0
4    2381741.0     1962.0  31471000.0            69.7   49982.0   46966.0

               LocalName                                GovernmentForm  \
0  Afganistan/Afqanestan                               Islamic Emirate
1              Nederland                       Constitutional Monarchy
2   Nederlandse Antillen  Nonmetropolitan Territory of The Netherlands
3              Shqipëria                                      Republic
4     Al-Jazair/Algérie                                      Republic

            HeadOfState  Capital Code2
0         Mohammad Omar      1.0    AF
1               Beatrix      5.0    NL
2               Beatrix     33.0    AN
3        Rexhep Mejdani     34.0    AL
4  Abdelaziz Bouteflika     35.0    DZ

In [5]:
q = 'SELECT * FROM Country ORDER BY Name;'
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT * FROM Country ORDER BY Name; |||

There are 239 rows in the query results table
There are 15 columns in the query results table

First 5 rows of the query results:
  Code            Name Continent                     Region  SurfaceArea  \
0  AFG     Afghanistan      Asia  Southern and Central Asia     652090.0
1  ALB         Albania    Europe            Southern Europe      28748.0
2  DZA         Algeria    Africa            Northern Africa    2381741.0
3  ASM  American Samoa   Oceania                  Polynesia        199.0
4  AND         Andorra    Europe            Southern Europe        468.0

   IndepYear  Population  LifeExpectancy      GNP   GNPOld  \
0     1919.0  22720000.0            45.9   5976.0      NaN
1     1912.0   3401200.0            71.6   3205.0   2500.0
2     1962.0  31471000.0            69.7  49982.0  46966.0
3        NaN     68000.0            75.1    334.0      NaN
4     1278.0     78000.0            83.5   1630.0      NaN

               LocalName                GovernmentForm           HeadOfState  \
0  Afganistan/Afqanestan               Islamic Emirate         Mohammad Omar
1              Shqipëria                      Republic        Rexhep Mejdani
2     Al-Jazair/Algérie                      Republic  Abdelaziz Bouteflika
3          Amerika Samoa                  US Territory        George W. Bush
4                Andorra  Parliamentary Coprincipality

   Capital Code2
0      1.0    AF
1     34.0    AL
2     35.0    DZ
3     54.0    AS
4     55.0    AD

In [6]:
q = 'SELECT Name, LifeExpectancy FROM Country ORDER BY Name;'
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, LifeExpectancy FROM Country ORDER BY Name; |||

There are 239 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
             Name  LifeExpectancy
0     Afghanistan            45.9
1         Albania            71.6
2         Algeria            69.7
3  American Samoa            75.1
4         Andorra            83.5

In [7]:
q = 'SELECT Name, LifeExpectancy AS "Life Expectancy" FROM Country ORDER BY Name;'
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, LifeExpectancy AS "Life Expectancy" FROM Country ORDER BY Name; |||

There are 239 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
             Name  Life Expectancy
0     Afghanistan             45.9
1         Albania             71.6
2         Algeria             69.7
3  American Samoa             75.1
4         Andorra             83.5

# Selecting Rows

In [8]:
q = 'SELECT Name, Continent, Region FROM Country;'
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region FROM Country; |||

There are 239 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                   Name      Continent                     Region
0           Afghanistan           Asia  Southern and Central Asia
1           Netherlands         Europe             Western Europe
2  Netherlands Antilles  North America                  Caribbean
3               Albania         Europe            Southern Europe
4               Algeria         Africa            Northern Africa

In [9]:
# using the where clause to filter
q = "SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe';"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe'; |||

There are 46 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                     Name Continent           Region
0             Netherlands    Europe   Western Europe
1                 Albania    Europe  Southern Europe
2                 Andorra    Europe  Southern Europe
3                 Belgium    Europe   Western Europe
4  Bosnia and Herzegovina    Europe  Southern Europe

In [10]:
# sort the results in alphabetical order for country name
q = "SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name; |||

There are 46 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
      Name Continent           Region
0  Albania    Europe  Southern Europe
1  Andorra    Europe  Southern Europe
2  Austria    Europe   Western Europe
3  Belarus    Europe   Eastern Europe
4  Belgium    Europe   Western Europe

In [11]:
# return only the first 5 rows from the same query
q = "SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name LIMIT 5;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name LIMIT 5; |||

There are 5 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
      Name Continent           Region
0  Albania    Europe  Southern Europe
1  Andorra    Europe  Southern Europe
2  Austria    Europe   Western Europe
3  Belarus    Europe   Eastern Europe
4  Belgium    Europe   Western Europe

In [12]:
# get the second 5 rows from the query
q = "SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name LIMIT 5 OFFSET 5;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name LIMIT 5 OFFSET 5; |||

There are 5 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                     Name Continent            Region
0  Bosnia and Herzegovina    Europe   Southern Europe
1                Bulgaria    Europe    Eastern Europe
2                 Croatia    Europe   Southern Europe
3          Czech Republic    Europe    Eastern Europe
4                 Denmark    Europe  Nordic Countries

# Selecting Columns

In [13]:
# select limited columns
q = "SELECT Name, Continent, Region from Country;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region from Country; |||

There are 239 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                   Name      Continent                     Region
0           Afghanistan           Asia  Southern and Central Asia
1           Netherlands         Europe             Western Europe
2  Netherlands Antilles  North America                  Caribbean
3               Albania         Europe            Southern Europe
4               Algeria         Africa            Northern Africa

In [14]:
#Change the name of a column
q = "SELECT Name AS Country, Continent, Region from Country;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name AS Country, Continent, Region from Country; |||

There are 239 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                Country      Continent                     Region
0           Afghanistan           Asia  Southern and Central Asia
1           Netherlands         Europe             Western Europe
2  Netherlands Antilles  North America                  Caribbean
3               Albania         Europe            Southern Europe
4               Algeria         Africa            Northern Africa

In [15]:
# rearrange column order
q = "SELECT Continent, Region, Name AS Country from Country;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Continent, Region, Name AS Country from Country; |||

There are 239 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
       Continent                     Region               Country
0           Asia  Southern and Central Asia           Afghanistan
1         Europe             Western Europe           Netherlands
2  North America                  Caribbean  Netherlands Antilles
3         Europe            Southern Europe               Albania
4         Africa            Northern Africa               Algeria

# Counting Rows

In [16]:
q = "SELECT COUNT(*) FROM Country;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(*) FROM Country; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(*)
0       239

In [17]:
# number of countries with more than 1m population
q = "SELECT COUNT(*) FROM Country WHERE Population > 1000000;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(*) FROM Country WHERE Population > 1000000; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(*)
0       154

In [18]:
# multiple where conditions
q = "SELECT COUNT(*) FROM Country WHERE Population > 100000000 AND Continent = 'Europe' ;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(*) FROM Country WHERE Population > 100000000 AND Continent = 'Europe' ; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(*)
0         1

In [19]:
# counting the number of values in the life expectancy column
q = "SELECT COUNT(LifeExpectancy) FROM Country;"
sh.query_result_stats(q, 'world.db')

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(LifeExpectancy) FROM Country; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(LifeExpectancy)
0                    222

# Inserting data

In [20]:
# inspect the table
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 3 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id        name            address     city state    zip
0   1  Bill Smith    123 Main Street     Hope    CA  98765
1   2  Mary Smith  123 Dorian Street  Harmony    AZ  98765
2   3   Bob Smith   123 Laugh Street    Humor    CA  98765

In [21]:
# add a row
q = "INSERT INTO customer (name, address, city, state, zip) VALUES ('Fred Flintstone', '123 Cobblestone Way', 'Bedrock', 'CA', '91234');"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO customer (name, address, city, state, zip) VALUES ('Fred Flintstone', '123 Cobblestone Way', 'Bedrock', 'CA', '91234'); |||

In [22]:
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 4 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name              address     city state    zip
0   1       Bill Smith      123 Main Street     Hope    CA  98765
1   2       Mary Smith    123 Dorian Street  Harmony    AZ  98765
2   3        Bob Smith     123 Laugh Street    Humor    CA  98765
3   4  Fred Flintstone  123 Cobblestone Way  Bedrock    CA  91234

In [23]:
# add another row without all columns
q = "INSERT INTO customer (name, city, state) VALUES ('Jimi Hendrix', 'Renton', 'WA');"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO customer (name, city, state) VALUES ('Jimi Hendrix', 'Renton', 'WA'); |||

In [25]:
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name              address     city state    zip
0   1       Bill Smith      123 Main Street     Hope    CA  98765
1   2       Mary Smith    123 Dorian Street  Harmony    AZ  98765
2   3        Bob Smith     123 Laugh Street    Humor    CA  98765
3   4  Fred Flintstone  123 Cobblestone Way  Bedrock    CA  91234
4   5     Jimi Hendrix                 None   Renton    WA   None

# Updating data

In [26]:
# inspect the table
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name              address     city state    zip
0   1       Bill Smith      123 Main Street     Hope    CA  98765
1   2       Mary Smith    123 Dorian Street  Harmony    AZ  98765
2   3        Bob Smith     123 Laugh Street    Humor    CA  98765
3   4  Fred Flintstone  123 Cobblestone Way  Bedrock    CA  91234
4   5     Jimi Hendrix                 None   Renton    WA   None

In [2]:
# fill in the blanks in the 5th Row
q = "UPDATE customer SET address = '123 Music Avenue', zip = '98056' WHERE id = 5;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| UPDATE customer SET address = '123 Music Avenue', zip = '98056' WHERE id = 5; |||

In [3]:
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name              address     city state    zip
0   1       Bill Smith      123 Main Street     Hope    CA  98765
1   2       Mary Smith    123 Dorian Street  Harmony    AZ  98765
2   3        Bob Smith     123 Laugh Street    Humor    CA  98765
3   4  Fred Flintstone  123 Cobblestone Way  Bedrock    CA  91234
4   5     Jimi Hendrix     123 Music Avenue   Renton    WA  98056

In [4]:
# change values in a row
q = "UPDATE customer SET address = '2603 S Washington St', zip = '98056' WHERE id = 5;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| UPDATE customer SET address = '2603 S Washington St', zip = '98056' WHERE id = 5; |||

In [5]:
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name               address     city state    zip
0   1       Bill Smith       123 Main Street     Hope    CA  98765
1   2       Mary Smith     123 Dorian Street  Harmony    AZ  98765
2   3        Bob Smith      123 Laugh Street    Humor    CA  98765
3   4  Fred Flintstone   123 Cobblestone Way  Bedrock    CA  91234
4   5     Jimi Hendrix  2603 S Washington St   Renton    WA  98056

In [6]:
q = "UPDATE customer SET address = NULL, zip = NULL WHERE id = 5;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| UPDATE customer SET address = NULL, zip = NULL WHERE id = 5; |||

In [7]:
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 5 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name              address     city state    zip
0   1       Bill Smith      123 Main Street     Hope    CA  98765
1   2       Mary Smith    123 Dorian Street  Harmony    AZ  98765
2   3        Bob Smith     123 Laugh Street    Humor    CA  98765
3   4  Fred Flintstone  123 Cobblestone Way  Bedrock    CA  91234
4   5     Jimi Hendrix                 None   Renton    WA   None

# Deleting data

In [8]:
# isolate what you want to delete
q = "SELECT * FROM customer WHERE id = 4;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer WHERE id = 4; |||

There are 1 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id             name              address     city state    zip
0   4  Fred Flintstone  123 Cobblestone Way  Bedrock    CA  91234

In [9]:
# delete the row
q = "DELETE FROM customer WHERE id = 4;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| DELETE FROM customer WHERE id = 4; |||

In [10]:
q = "SELECT * FROM customer;"
sh.query_result_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM customer; |||

There are 4 rows in the query results table
There are 6 columns in the query results table

First 5 rows of the query results:
   id          name            address     city state    zip
0   1    Bill Smith    123 Main Street     Hope    CA  98765
1   2    Mary Smith  123 Dorian Street  Harmony    AZ  98765
2   3     Bob Smith   123 Laugh Street    Humor    CA  98765
3   5  Jimi Hendrix               None   Renton    WA   None